---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCProductWrapper.AddSite(Autodesk.Revit.DB.IFC.IFCAnyHandle)
source: html/d0be3b52-c2b5-8f69-0fc6-19a992d35143.htm
---
# Autodesk.Revit.DB.IFC.IFCProductWrapper.AddSite Method

Adds a site (IfcObject) handle to associate with the IfcProduct in this wrapper.

## Syntax (C#)
```csharp
public void AddSite(
	IFCAnyHandle siteHandle
)
```

## Parameters
- **siteHandle** (`Autodesk.Revit.DB.IFC.IFCAnyHandle`) - The site handle.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null